Hybrid-Memcached/ex2_result/memtier_6t_16t_default_datasize_18_cycle_100_result
16        Threads
50        Connections per thread
120       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        19972.56          ---          ---        39.80082        38.65500        67.07100        82.43100      1150.76 
Gets           17.11        17.11         0.00        37.06177        37.11900        52.47900        71.67900         1.34 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      19989.67        17.11         0.00        39.79848        38.65500        67.07100        82.43100      1152.10 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.951        0.000
SET      35.071        5.000
SET      35.839       10.000
SET      36.351       15.000
SET      36.863       20.000
SET      37.119       25.000
SET      37.631       30.000
SET      37.887       35.000
SET      38.143       40.000
SET      38.399       45.000
SET      38.655       50.000
SET      38.911       52.500
SET      38.911       55.000
SET      39.167       57.500
SET      39.167       60.000
SET      39.423       62.500
SET      39.423       65.000
SET      39.679       67.500
SET      39.679       70.000
SET      39.935       72.500
SET      39.935       75.000
SET      40.191       76.250
SET      40.191       77.500
SET      40.447       78.750
SET      40.447       80.000
SET      40.447       81.250
SET      40.703       82.500
SET      40.959       83.750
SET      41.215       85.000
SET      41.471       86.250
SET      41.983       87.500
SET      42.239       88.125
SET      42.751       88.750
SET      43.263       89.375
SET      43.775       90.000
SET      44.287       90.625
SET      45.311       91.250
SET      46.335       91.875
SET      47.359       92.500
SET      48.639       93.125
SET      49.663       93.750
SET      50.431       94.062
SET      51.199       94.375
SET      52.223       94.688
SET      53.759       95.000
SET      55.551       95.312
SET      57.087       95.625
SET      58.367       95.938
SET      59.903       96.250
SET      60.671       96.562
SET      61.439       96.875
SET      61.695       97.031
SET      61.951       97.188
SET      62.463       97.344
SET      62.463       97.500
SET      62.719       97.656
SET      63.231       97.812
SET      63.487       97.969
SET      63.743       98.125
SET      64.255       98.281
SET      64.767       98.438
SET      65.023       98.516
SET      65.279       98.594
SET      65.535       98.672
SET      66.047       98.750
SET      66.559       98.828
SET      66.559       98.906
SET      67.071       98.984
SET      67.071       99.062
SET      67.583       99.141
SET      67.583       99.219
SET      68.095       99.258
SET      68.095       99.297
SET      68.607       99.336
SET      68.607       99.375
SET      69.119       99.414
SET      69.119       99.453
SET      69.631       99.492
SET      70.143       99.531
SET      71.167       99.570
SET      71.679       99.609
SET      72.191       99.629
SET      72.703       99.648
SET      73.215       99.668
SET      73.727       99.688
SET      74.239       99.707
SET      74.751       99.727
SET      75.263       99.746
SET      76.287       99.766
SET      76.799       99.785
SET      77.311       99.805
SET      77.823       99.814
SET      77.823       99.824
SET      78.335       99.834
SET      78.847       99.844
SET      79.359       99.854
SET      79.359       99.863
SET      79.871       99.873
SET      80.383       99.883
SET      81.407       99.893
SET      82.943       99.902
SET      84.479       99.907
SET      87.039       99.912
SET      91.135       99.917
SET      96.255       99.922
SET     100.863       99.927
SET     108.031       99.932
SET     116.223       99.937
SET     120.319       99.941
SET     123.903       99.946
SET     126.463       99.951
SET     128.511       99.954
SET     130.559       99.956
SET     134.143       99.958
SET     139.263       99.961
SET     143.359       99.963
SET     147.455       99.966
SET     151.551       99.968
SET     155.647       99.971
SET     160.767       99.973
SET     162.815       99.976
SET     164.863       99.977
SET     166.911       99.978
SET     167.935       99.979
SET     169.983       99.980
SET     172.031       99.982
SET     174.079       99.983
SET     176.127       99.984
SET     178.175       99.985
SET     181.247       99.987
SET     185.343       99.988
SET     187.391       99.988
SET     192.511       99.989
SET     209.919       99.990
SET     238.591       99.990
SET     282.623       99.991
SET     315.391       99.991
SET     358.399       99.992
SET     405.503       99.993
SET     446.463       99.993
SET     497.663       99.994
SET     518.143       99.994
SET     540.671       99.995
SET     561.151       99.995
SET     593.919       99.995
SET     622.591       99.995
SET     643.071       99.996
SET     667.647       99.996
SET     700.415       99.996
SET     729.087       99.997
SET     753.663       99.997
SET     774.143       99.997
SET     782.335       99.997
SET     794.623       99.997
SET     811.007       99.998
SET     823.295       99.998
SET     843.775       99.998
SET     856.063       99.998
SET     868.351       99.998
SET     884.735       99.998
SET     892.927       99.998
SET     909.311       99.999
SET     917.503       99.999
SET     917.503       99.999
SET     929.791       99.999
SET     937.983       99.999
SET     942.079       99.999
SET     958.463       99.999
SET     962.559       99.999
SET     966.655       99.999
SET     966.655       99.999
SET     983.039       99.999
SET     987.135       99.999
SET     991.231       99.999
SET     991.231       99.999
SET     991.231       99.999
SET     995.327       99.999
SET    1011.711      100.000
SET    1015.807      100.000
SET    1015.807      100.000
SET    1015.807      100.000
SET    1019.903      100.000
SET    1019.903      100.000
SET    1019.903      100.000
[...]
SET    1023.999      100.000
SET    1023.999      100.000
SET    1036.287      100.000
SET    1036.287      100.000
SET    1036.287      100.000
[...]
SET    1040.383      100.000
SET    1040.383      100.000
SET    1040.383      100.000
[...]
SET    1048.575      100.000
SET    1048.575      100.000
---
GET      25.343        0.000
GET      31.359        5.000
GET      33.279       10.000
GET      34.559       15.000
GET      35.071       20.000
GET      35.583       25.000
GET      35.839       30.000
GET      36.095       35.000
GET      36.351       40.000
GET      36.607       45.000
GET      37.119       50.000
GET      37.119       52.500
GET      37.375       55.000
GET      37.375       57.500
GET      37.631       60.000
GET      37.887       62.500
GET      37.887       65.000
GET      38.143       67.500
GET      38.399       70.000
GET      38.399       72.500
GET      38.655       75.000
GET      38.655       76.250
GET      38.911       77.500
GET      38.911       78.750
GET      38.911       80.000
GET      39.167       81.250
GET      39.167       82.500
GET      39.167       83.750
GET      39.423       85.000
GET      39.423       86.250
GET      39.423       87.500
GET      39.679       88.125
GET      39.679       88.750
GET      39.679       89.375
GET      39.935       90.000
GET      39.935       90.625
GET      39.935       91.250
GET      40.191       91.875
GET      40.191       92.500
GET      40.447       93.125
GET      40.703       93.750
GET      40.703       94.062
GET      40.959       94.375
GET      41.215       94.688
GET      41.471       95.000
GET      41.727       95.312
GET      42.239       95.625
GET      42.495       95.938
GET      43.007       96.250
GET      43.519       96.562
GET      44.031       96.875
GET      44.799       97.031
GET      45.567       97.188
GET      46.079       97.344
GET      46.847       97.500
GET      47.103       97.656
GET      48.127       97.812
GET      48.895       97.969
GET      49.151       98.125
GET      49.919       98.281
GET      50.431       98.438
GET      50.687       98.516
GET      50.943       98.594
GET      51.199       98.672
GET      51.455       98.750
GET      51.455       98.828
GET      52.223       98.906
GET      52.479       98.984
GET      52.735       99.062
GET      53.247       99.141
GET      53.247       99.219
GET      53.503       99.258
GET      53.503       99.297
GET      55.039       99.336
GET      57.855       99.375
GET      57.855       99.414
GET      59.135       99.453
GET      59.391       99.492
GET      59.903       99.531
GET      63.487       99.570
GET      63.487       99.609
GET      67.583       99.629
GET      67.583       99.648
GET      69.631       99.668
GET      69.631       99.688
GET      69.631       99.707
GET      69.631       99.727
GET      69.631       99.746
GET      70.655       99.766
GET      70.655       99.785
GET      70.655       99.805
GET      71.167       99.814
GET      71.167       99.824
GET      71.167       99.834
GET      71.167       99.844
GET      71.167       99.854
GET      71.679       99.863
GET      71.679       99.873
GET      71.679       99.883
GET      71.679       99.893
GET      71.679       99.902
GET      73.215       99.907
GET      73.215       99.912
GET      73.215       99.917
GET      73.215       99.922
GET      73.215       99.927
GET      73.215       99.932
GET      73.215       99.937
GET      73.215       99.941
GET      73.215       99.946
GET      73.215       99.951
GET     108.031       99.954
GET     108.031      100.000
---
WAIT      0.000      100.000